package exercise;
/*
N 개의 도시가 있다. 각 도시는 1번부터N번까지 번호가 매겨져있다. 
그리고 서로 다른 두 도시를 잇는 M개의 도로가 있다. 도로마다 길이가 다를 수 있으며, 
어떠한 두 도시는 여러 개의 도로로 이어져 있을 수 있다.

태양이의 집은 1번 도시에 있고, 명우의 집은 N번 도시에 있다. 
태양이는 자신의 집에서 명우의 집으로 놀러가려고 한다. 
단, 조금이라도 빨리 명우를 보고 싶어하는 마음에 최대한 빠르게 이동하려고 한다.

태양이를 도와 1번 도시에서 N번 도시로 가는 최단 거리를 구하는 프로그램을 작성하시오.

입력
입력의 첫 줄에 도시의 수를 나타내는 자연수 N과 도로의 개수를 나타내는 정수M
이 공백으로 구분되어 주어진다. (1≤N≤100,000, 0≤M≤300,000)

그 다음 M개의 줄에 각 도로를 나타내는 세 개의 자연수 a,b,c가 공백으로 구분되어 주어진다.
이는a번 도시와b번 도시를 연결하는 길이c인 도로를 의미한다. 
(1≤a,b≤N,a≠b,1≤c≤106)
출력
1번 도시에서N번 도시로 주어진 도로를 통해 이동할 때 최단 거리를 출력한다. 
만약 이동할 수 없으면 −1을 출력한다.

6 9
1 2 2
1 3 4
2 3 1
2 4 4
2 5 2
3 5 3
4 5 1
4 6 2
5 6 4

7

3 2
1 2 1
1 2 2

-1
*/
public class 그래프_DIJKSTRA_KOITP_최단경로 {

	public static void main(String[] args) {
		// TODO Auto-generated method stub

	}

}
